app/Views/templates/header.php

SELECT *
FROM `users`
WHERE `users`.`id` = '11'
---
            <?php if (session()->has('user_id')): ?>
                <?php
                    $userModel = new \App\Models\UserModel();
                    $user = $userModel->find(session('user_id'));