app/Controllers/Dashboard.php

    public function index()
    {
        // Redirect jika belum login
        if (!session()->get('user_id')) return redirect()->to('/login');

        $userId = session()->get('user_id');

        $foodModel = new FoodModel();
        $userModel = new UserModel();

        // Ambil data user dan target kalori default jika kosong
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '11'

    public function history()
    {
        if (!session()->get('user_id')) return redirect()->to('/login');

        $userId = session()->get('user_id');
        $foodModel = new FoodModel();

        $histories = $foodModel
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `foods`
WHERE `user_id` = '11'
ORDER BY `created_at` DESC

    public function profile()
        {
            if (!session()->get('user_id')) return redirect()->to('/login');

            $userModel = new \App\Models\UserModel();
            $user = $userModel->find(session()->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '11'