app/Models/FoodModel.php

SELECT *
FROM `foods`
WHERE `user_id` = '11'
AND DATE(created_at) = '2025-07-03'
ORDER BY `created_at` DESC
---
    public function getFoodsByDate($userId, $date)
    {
        return $this->where('user_id', $userId)
                    ->where('DATE(created_at)', $date)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();

SELECT SUM(`kalori`) AS `kalori`
FROM `foods`
WHERE `user_id` = '11'
AND DATE(created_at) = '2025-07-03'
 LIMIT 1
---
    public function getTotalKaloriHariIni($userId)
    {
        $result = $this->selectSum('kalori')
                       ->where('user_id', $userId)
                       ->where('DATE(created_at)', date('Y-m-d'))
                       ->first();

SELECT COUNT(*) AS `numrows`
FROM `foods`
WHERE `user_id` = '11'
AND DATE(created_at) = '2025-07-03'
---
    public function getJumlahItemHariIni($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('DATE(created_at)', date('Y-m-d'))
                    ->countAllResults();

SELECT DATE(created_at) as tanggal, SUM(kalori) as total_kalori
FROM `foods`
WHERE `user_id` = '11'
AND `created_at` >= '2025-06-27'
GROUP BY DATE(created_at)
ORDER BY `tanggal` ASC
---
    public function getKaloriMingguan($userId)
    {
        return $this->select("DATE(created_at) as tanggal, SUM(kalori) as total_kalori")
                    ->where('user_id', $userId)
                    ->where('created_at >=', date('Y-m-d', strtotime('-6 days')))
                    ->groupBy('DATE(created_at)')
                    ->orderBy('tanggal', 'ASC')
                    ->findAll();